CREATE PROCEDURE add_Дивиденты
@Дата_начисления DATETIME,
@Сумма MONEY,
@Организация VARCHAR(150),
@Налоговая_база MONEY,
@Ставка_налога INT,
@Номер_ПлатежныйДок VARCHAR(20),
@Дата_ПлатежныйДок DATETIME,
@Сумма_ПлатежныйДок MONEY
AS

DECLARE @IDdoc INT
IF (@Номер_ПлатежныйДок IS NOT NULL)
	BEGIN
		EXEC add_ПлатежныйДокумент @Номер_ПлатежныйДок, @Дата_ПлатежныйДок, @Сумма_ПлатежныйДок, @IDdoc output;
	END
	
INSERT INTO Налоги_на_дивиденты (Дата_начисления_дивидентов, Сумма, Наименование_организации, Налоговая_база, Ставка_налога, ID_платежный_док, DEL)
VALUES (@Дата_начисления, @Сумма, @Организация, @Налоговая_база, @Ставка_налога, @IDdoc, 0)